import 'package:tech_blog/Models/list.dart';

import '../gen/assets.gen.dart';

Map coverHeaderMap = {
  "imagePath": Assets.images.public.cover.path,
  'writer': 'مهرداد حسینی',
  "date": "یک روز پیش",
  "title": "دوازده قدم برنامه نویسی یک دوره",
  "views": "253"
};

List<ListTags> tagCategory = [
  ListTags(title: "کسب و کار"),
  ListTags(title: "مارکتینگ"),
  ListTags(title: "تکنولوژی"),
  ListTags(title: "برنامه نویسی"),
  ListTags(title: "اینترنت اشیاء"),
  ListTags(title: "پادکست"),
];

late List<ListTags> favCategory = [];

List<HotestArticle> hotestArticle = [
  HotestArticle(
      id: "1",
      imageUrl: "https://static.digiato.com/digiato/2024/04/0_15-910x600.jpg",
      title:
          "اگزینوس ۲۵۰۰ احتمالاً عملکرد بهینه‌تر نسبت به اسنپدراگون ۸ نسل ۴ خواهد داشت",
      date: "1 ساعت پیش",
      writer: "امیر امام",
      writerPhoto:
          "https://digiato.com/wp-content/uploads/avatars/20493-32x32.jpg",
      views: "320",
      content: """
        به نظر می‌رسد که سامسونگ درحال کار روی تراشه اختصاصی جدید خود تحت عنوان اگزینوس ۲۵۰۰ است و انتظار می‌رود که شاهد استفاده از آن در بعضی نسخه‌های گلکسی S25 باشیم. طبق گزارشات غیررسمی که به‌تازگی منتظر شده‌اند، تراشه پرچم‌دار آتی سامسونگ می‌تواند عملکرد بهینه‌تری در مقایسه با اسنپدراگون ۸ نسل ۴ از خود نشان دهد. 
        سامسونگ چندی قبل، تایید کرد که درحال‌توسعه تراشه‌ای همراه با فرایند ساخت ۳ نانومتری است که در پرچم‌دار بعدی این شرکت برای بعضی نواحی خاص، درنظر گرفته شده‌است. استفاده از فرایند ساخت ۳ نانومتری نه‌تنها می‌تواند قدرت بیشتری را در اندازه مشابه، به‌همراه داشته‌باشد؛ بلکه مصرف انرژی تراشه را هم به‌طور محسوسی کاهش می‌دهد. شایان‌ذکر است که تراشه پرچم‌دار فعلی سامسونگ یعنی اگزینوس ۲۴۰۰، با فرایند ۴ نانومتری ساخته شده‌است.

طبق یک گزارش جدید که از سوی یک افشاگر در پلتفرم ایکس منتشر شده‌است، تراشه مورد بحث، احتمالاً مصرف انرژی بهینه‌تری در مقایسه با اسنپدراگون ۸ نسل ۴ خواهد داشت که طبق فرایند ۳ نانومتری TSMC ساخته می‌شود. وی همچنین ادعا دارد که اگزینوس ۲۵۰۰ می‌تواند در کنار مصرف انرژی کمتر در مقایسه با نسل قبل، قدرت بیشتری را ارائه دهد؛ امری که با کاهش اندازه فرایند ساخت، قابل پیش‌بینی به نظر می‌رسد.
      """),
  HotestArticle(
      id: "2",
      imageUrl:
          "https://static.digiato.com/digiato/2024/04/Dacia-Sandero-Stepway-10-910x600.jpg",
      title: "گارانتی هفت ساله داچیا برای خودروهای دست ‌دوم در بریتانیا",
      date: "4 ساعت پیش",
      writer: "مرتضی قانع",
      writerPhoto:
          "https://digiato.com/wp-content/uploads/avatars/58838-32x32.jpg",
      views: "98",
      content: """
        برند داچیا زیرشاخه اقتصادی رنو است که خودروهای آن را با برند رنو در بازار کشورمان شاهد بوده‌ایم. تندر 90 (لوگان)، ساندرو، سیمبل (لوگان نسل دوم) و داستر محصولاتی از برند داچیا هستند. این برند پرفروش به تازگی طرح گارانتی هفت ساله جدیدی را ارائه داده است که حتی خودروهای دست ‌دوم با کارکرد هزاران مایل را نیز پوشش می‌دهد.
      طرح داچیا زن (Dacia Zen) برای هر مدل داچیا که کمتر از شش سال و کمتر از ۷۵ هزار مایل کار کرده باشد قابل استفاده است. خودرو برای تحت پوشش قرار گرفتن باید هر ساله سرویس شود.

داچیا می‌گوید حتی در صورتی که مالکان پیش از این خودرو را در اختیار تعمیرکاران غیررسمی قرار داده باشند جریمه نمی‌شوند. برای خودروهای جدید، گارانتی داچیا زن پس از پایان پوشش استاندارد سه ساله در صورت انجام سرویس‌های رسمی آغاز می‌شود."""),
  HotestArticle(
      id: "3",
      imageUrl:
          "https://static.digiato.com/digiato/2024/04/NASA-dragonfly-titan-saturn-910x600.jpg",
      title: "ناسا به مأموریت پهپاد سنجاقک در قمر سیاره زحل چراغ سبز نشان داد",
      date: "1 روز پیش",
      writer: "جواد تاجی",
      writerPhoto:
          "https://digiato.com/wp-content/uploads/avatars/224206-32x32.jpg",
      views: "3472",
      content: """
        ناسا به‌تازگی به مأموریت پهپاد «سنجاقک» (Dragonfly) برای حضور در تیتان، بزرگ‌ترین قمر سیاره زحل چراغ سبز نشان داده است. با این وجود، روند طراحی و توسعه این پهپاد به سمت جلو پیش خواهد رفت و پس از آن، یک مرحله آزمایشی برای تأیید عملکرد آن طراحی خواهد شد.
        اگر همه‌چیز طبق برنامه پیش برود، دراگون‌فلای در سال 2028 به فضا پرتاب خواهد شد و در سال 2034 به قمر غنی از مواد آلی تایتان خواهد رسید. پس از استقرار، در بین ده‌ها مکان علمی جالب پرواز خواهد کرد تا به‌دنبال شواهدی از فرآیندهای شیمیایی پیش زیستی رایج آن باشد. بنابراین دانشمندان امیدوارند که این ماموریت بتواند به آنها کمک کند تا درباره چگونگی شروع زندگی در سیاره ما و اهداف دیگر خود اطلاعات بیشتری کسب کنند.
        """),
  HotestArticle(
      id: "4",
      imageUrl:
          "https://static.digiato.com/digiato/2024/04/Robot-Football-910x600.jpg",
      title:
          "ربات‌های دوپا گوگل به‌لطف هوش مصنوعی، حالا سریع‌تر و قدرتمندتر از قبل فوتبال بازی می‌کنند",
      date: "1 روز پیش",
      writer: "جواد تاجی",
      writerPhoto:
          "https://digiato.com/wp-content/uploads/avatars/224206-32x32.jpg",
      views: "1213",
      content:
          """در روند توسعه این ربات‌ها، دو تکنیک مهم هوش مصنوعی با یکدیگر ترکیب شده است: یادگیری تقویتی که باعث می‌شود ربات‌ها با هدف دریافت پاداش پس از انتخاب صحیح خود، از طریق آزمون‌و‌خطا مهارت کسب کنند و یادگیری عمیق (تلاش برای تقلید از مغز انسان)، برای تجزیه‌و‌تحلیل الگوها
        محققان گوگل Robotis OP3 را با ربات‌هایی مقایسه کرده‌اند که با مهارت‌های از پیش تعیین‌شده کار می‌کنند. به گفته آن‌ها، ربات‌هایی که با یادگیری تقویتی عمیق آموزش داده شده‌اند، می‌توانند 181 درصد سریع‌تر بازی کنند، 302 درصد سریع‌تر بچرخند و 34 درصد محکم‌تر به توپ ضربه بزنند. همچنین پس از افتادن بر روی زمین، 63 درصد سریع‌تر از جای خود بلند می‌شوند.
      """),
  HotestArticle(
      id: "5",
      imageUrl:
          "https://api2.zoomit.ir/media/2021-1-bitcoin-crash-638bb31d8b369136d4587431?w=828&q=80",
      title:
          "ادامه سقوط بیت‌ کوین؛ قیمت پادشاه رمزارزها به زیر ۶۰ هزار دلار رسید",
      date: "2 روز پیش",
      writer: "مجتبی بوالحسنی",
      writerPhoto: "https://api2.zoomit.ir/media/6593b139283a066c4577fff8?q=75",
      views: "980",
      content:
          """بازار ارزهای دیجیتال با اصلاح قیمتی مواجه شده است و بیت کوین به‌عنوان رهبر این بازار امروز ریزش قابل‌توجهی را تجربه کرد. ارزش هر واحد بیت کوین که در روز شنبه توانسته بود بخشی‌از ریزش نسبتاً عمیق چند روز اخیرش را جبران کند، امروز صبح در معاملات بازار به زیر سطح ۶۰ هزار دلار هم رسید.

بیت کوین در ساعات ابتدایی روز جاری موفق شد از سطح ۶۴ هزار دلار عبور کند، اما در ادامه با ریزش بیش از ۳ درصدی طی ۲۴ ساعت گذشته به پایین‌ترین قیمت از ابتدای مارس ۲۰۲۴ (اسفند ۱۴۰۲ و فروردین ۱۴۰۳) رسید. در زمان نگارش این خبر، هر واحد بیت کوین با قیمت حدود ۶۱٬۸۳۰ دلار معامله می‌شود."""),
  HotestArticle(
      id: "6",
      imageUrl:
          "https://api2.zoomit.ir/media/2018-1-89768488-6005-4acb-adc6-4f45d0c35e04-638ba311495859f4e0c288c8?w=828&q=80",
      title: "آشنایی با ارز تلگرام: تون کوین چیست و چه کاربردی دارد؟",
      date: "3 روز پیش",
      writer: "شاهو فریور",
      writerPhoto: "https://api2.zoomit.ir/media/6374fe22807a6958d664eb07?q=75",
      views: "118",
      content:
          """تون (TON) بلاک چین لایه-۱ و غیرمتمرکزی است که تلگرام در سال ۲۰۱۸ منتشر کرد.

بعدها تلگرام از این پروژه خارج شد و بنیاد تون آن را در اختیار گرفت و نام آن را از «شبکه آزاد تلگرام (Telegram Open Network)» به «شبکه آزاد (The Open Network)» تغییر داد. تون کوین نیز که قبلاً گرام (Gram) نام داشت، ارز بومی شبکه‌ی تون است.

از سال ۲۰۲۰ تاکنون بنیاد تون، که مجموعه‌ای از علاقه‌مندان و حامیان مستقل پروژه‌ است، توانسته این پروژه را هرچه بیشتر توسعه دهد.

هدف از ساخت شبکه‌ی تون، یکپارچه کردن آن با اپلیکیشنی بود تا کاربران بتوانند به آسانی توسط آن دارایی‌های خود راجابه‌جا یا ذخیره‌سازی کنند."""),
  HotestArticle(
      id: "7",
      imageUrl:
          "https://api2.zoomit.ir/media/pavel-durov-6620dee0a55162c757fc5e15?w=1680&q=80",
      title: "مصاحبه کم‌سابقه بنیان‌گذار تلگرام: به‌دنبال آزادی هستم، نه ثروت",
      date: "3 روز پیش",
      writer: "مرجان شیخی",
      writerPhoto: "https://api2.zoomit.ir/media/6374f631807a6958d6644b74?q=75",
      views: "2000",
      content:
          """دورف در مصاحبه‌ی یک‌ساعته و جذابش با تاکر کارلسون که تا این لحظه نزدیک‌به ۲ میلیون بار در یوتیوب دیده شده، داستان شروع تلگرام را شرح می‌دهد و حرف‌های جالبی درباره‌ی حریم شخصی، وضعیت آزادی بیان در شبکه‌های اجتماعی و شیوه‌ی اداره‌ی تلگرام می‌گوید؛ مثلا اینکه حتی یک دلار برای تبلیغ تلگرام خرج نکرده، معتقد است پیام‌رسان‌های دیگر پنج، شش سال از قابلیت‌های تلگرام عقب هستند و بیشترین فشار برای سانسور محتوا را نه از سمت دولت‌ها، بلکه از سمت اپل و گوگل تحمل می‌کند."""),
];

List<ListPodcast> listPodcast = [
  ListPodcast(
      title: 'ارز دیجیتال',
      author: 'مهرداد حسینی',
      imgUrl: Assets.images.podcast.crypto.path,
      epTitle: 'کریپتو چیست',
      time: '22:00'),
  ListPodcast(
      title: 'پرسان',
      author: 'محمد احمدی',
      imgUrl: Assets.images.podcast.porsan.path,
      epTitle: 'پرسان',
      time: '10:32'),
  ListPodcast(
      title: 'رفتار',
      author: 'مینا اسدی',
      imgUrl: Assets.images.podcast.raftar.path,
      epTitle: 'مدیریت رفتار',
      time: '08:00'),
  ListPodcast(
      title: 'روبوتیک',
      author: 'مهرداد حسینی',
      imgUrl: Assets.images.podcast.robo.path,
      epTitle: 'روبوتیک',
      time: '11:00'),
  ListPodcast(
      title: 'رادیو فناوری',
      author: 'حسن رضائی',
      imgUrl: Assets.images.podcast.siket.path,
      epTitle: 'کوانتوم چیست',
      time: '22:00'),
];
